[
  {
    "name": "Hugo Trebels",
    "text": "I first met Aidan when he was doing his rather impressive workouts outside - hanging from a tree using two rings. Since then he has gained his qualifications and as fate would have it, I was on the look out for a new masseur who lived close by. Aidan contacted me, offering his sports massage and I have just had my first session. Aidan is a true pro. We discussed my lifestyle, my health and any physical issues and he went to work. Aidan explains everything as he is working which really helps to put you at ease, especially when he works on those tight knots! And I have many. He also really focussed on my legs as I have a long term problem with my knees. He is strong yet gentle and constantly checks whether the pressure is ok. Once he had finished, the effect were pretty immediate. Just walking down the road my knees were hurting less already. He also gave me some exercises to do which should help with the knees too! I can't wait to book again. On a personal note - I admire Aidan - he has achieved so much and he is still a youngster! Truly a gentleman as well. Highly recommended!",
    "rating": 5
  },
  {
    "name": "Aparana Chandran M.P",
    "text": "I joined the gym about two months ago and came across Aidan's profile in our gym group. He truly stands out, and sometimes words fall short in describing his impact. His support has infused me with energy and hope every day. I aimed to lose weight, and in these two months, I've shed 9 kg. Although I've missed a few classes due to personal issues, Aidan's commitment is unwavering; he never misses a scheduled training session, showcasing his punctuality and passion for fitness. He is always understanding and friendly and also possesses an impressive depth of knowledge about bodybuilding and workouts. Aidan is always available to address any questions I have regarding diet and exercise, making him an invaluable resource on my fitness journey.",
    "rating": 5
  },
  {
    "name": "Marc Beattie",
    "text": "This lad is both young and old. He's got youth on his side but he has the knowledge of an older PT. Aidan is keen to know everything about his clients in order to develop the best possible routine for clients to achieve their goals. I'm 4 months in and have seen some crazy improvements both physically and mentally. I'm looking forward to seeing how much he is capable of pushing my physical health and limits in the future.",
    "rating": 5
  },
  {
    "name": "Shea Potter",
    "text": "I searched tirelessly to find the perfect PT for my gym sessions and the search is now over! The most flexible, versatile and impactful training I have ever done. Whether it's muscle gain, weight loss or just general health and fitness Aidan is the guy you need. Every session delivered with a smile and enthusiasm because of his passion for it, cannot fault him, highly recommend!",
    "rating": 5
  },
  {
    "name": "Sophie Hodson",
    "text": "I started out with very little knowledge of exercising. Aidan is great at explaining how all the exercises work and which muscles you are working. Aidan is very motivating and helps you to build up your fitness gradually. I would highly recommend Aidan to help you on your fitness journey.",
    "rating": 5
  },
  {
    "name": "James Martin",
    "text": "Aidan is absolutely fantastic, I have had 5 sessions with him so far and it has completely changed how I workout. In the last month and a bit there has been noticeable changes to my physique, and it's all down to Aidan. Thank you again and I cannot recommend highly enough to anyone at any experience level.",
    "rating": 5
  },
  {
    "name": "Sol Costa",
    "text": "I've been doing work out with Aidan, he's fantastic personal trainer, very knowledgeable, I highly recommend him. Thank you Aidan ✨😊💪",
    "rating": 5
  }
]
